performance-test-reports/publish-mobile-n-load-test-report/12532220483/1/user-login/user_login/run.log
-    █ setup

-      █ Given Multiple Users Can access the system

-    █ And [Auth Service] Login Endpoint is accessible

-      █ When more than 10 users are trying to login at the same time

-        ✓ test start time : 2024-12-29T03:48:27Z
-        ✓ request url : http://localhost:5500/client_login
-        ✗ response status : 200
-         ↳  97% — ✓ 330713 / ✗ 6826
-        ✓ response: isJson
-        ✓ Mock N/A
-        ✓ response error : none
-        ✗ response error : 
		status-->0
		error-->read: connection reset by peer
-         ↳  0% — ✓ 0 / ✗ 2007
-        ✗ response error : 
		status-->0
		error-->dial: i/o timeout
-         ↳  0% — ✓ 0 / ✗ 1564
-        ✗ response error : 
		status-->0
		error-->request timeout
-         ↳  0% — ✓ 0 / ✗ 3255

-      █ Then the system should be able to handle the load and respond with status 200

-        ✗ expected response status to equal 200
-         ↳  97% — ✓ 330713 / ✗ 6826
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-      █ And verify the load test client should find the breaking point

-        ✗ expected response status to equal 200
-         ↳  97% — ✓ 330713 / ✗ 6826
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-    _response_errors_cnt...........: 6826    7.95074/s
-    _response_success_cnt..........: 330713  385.205554/s
-    _response_total_cnt............: 337539  393.156294/s
-    checks.........................: 99.32%  ✓ 3995860     ✗ 27304 
-    data_received..................: 117 MB  136 kB/s
-    data_sent......................: 78 MB   91 kB/s
-    dropped_iterations.............: 1624490 1892.161996/s
-    group_duration.................: avg=910.24ms min=242.08µs med=2.48ms   max=1m1s     p(90)=1.27s    p(95)=2.49s   
-    http_req_blocked...............: avg=453.43ms min=0s       med=174.06µs max=19.58s   p(90)=1.03s    p(95)=2.05s   
-    http_req_connecting............: avg=453.37ms min=0s       med=135.06µs max=19.58s   p(90)=1.03s    p(95)=2.05s   
-  ✗ http_req_duration..............: avg=1.22s    min=0s       med=249.25ms max=1m0s     p(90)=713.68ms p(95)=1.44s   
-      { expected_response:true }...: avg=518.39ms min=1.32ms   med=248.88ms max=58.88s   p(90)=634.44ms p(95)=1.14s   
-  ✗ http_req_failed................: 2.02%   ✓ 6826        ✗ 330713
-    http_req_receiving.............: avg=1.14ms   min=0s       med=84.86µs  max=189.34ms p(90)=1.33ms   p(95)=3.13ms  
-    http_req_sending...............: avg=722.7µs  min=0s       med=34.22µs  max=172.45ms p(90)=208.7µs  p(95)=851.21µs
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=1.22s    min=0s       med=248.63ms max=1m0s     p(90)=709.38ms p(95)=1.43s   
-    http_reqs......................: 337539  393.156294/s
-    iteration_duration.............: avg=1.82s    min=3.28ms   med=256.77ms max=1m1s     p(90)=2.49s    p(95)=5.17s   
-    iterations.....................: 337539  393.156294/s
-    vus............................: 1       min=0         max=1000
-    vus_max........................: 1000    min=405       max=1000